Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x172 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x87): GNU C++ 4.8.4 -mcpu=cortex-m3 -mthumb -g -O0 -fno-exceptions -fmessage-length=0 -fno-common -fgcse-after-reload -fno-builtin -fsingle-precision-constant -fdata-sections -ffunction-sections
    <10>   DW_AT_language    : 4	(C++)
    <11>   DW_AT_name        : (indirect string, offset: 0x1a7): C:\Plug & Drive Studio\PNDS-2.1.7-x86\workspace\NanoJ project\gen\mapping.cxx
    <15>   DW_AT_stmt_list   : 0x0
 <1><19>: Abbrev Number: 2 (DW_TAG_base_type)
    <1a>   DW_AT_byte_size   : 4
    <1b>   DW_AT_encoding    : 7	(unsigned)
    <1c>   DW_AT_name        : (indirect string, offset: 0x46): unsigned int
 <1><20>: Abbrev Number: 3 (DW_TAG_base_type)
    <21>   DW_AT_byte_size   : 4
    <22>   DW_AT_encoding    : 5	(signed)
    <23>   DW_AT_name        : int
 <1><27>: Abbrev Number: 4 (DW_TAG_typedef)
    <28>   DW_AT_name        : U32
    <2c>   DW_AT_decl_file   : 1
    <2d>   DW_AT_decl_line   : 25
    <2e>   DW_AT_type        : <0x19>
 <1><32>: Abbrev Number: 4 (DW_TAG_typedef)
    <33>   DW_AT_name        : S32
    <37>   DW_AT_decl_file   : 1
    <38>   DW_AT_decl_line   : 26
    <39>   DW_AT_type        : <0x20>
 <1><3d>: Abbrev Number: 4 (DW_TAG_typedef)
    <3e>   DW_AT_name        : U16
    <42>   DW_AT_decl_file   : 1
    <43>   DW_AT_decl_line   : 27
    <44>   DW_AT_type        : <0x48>
 <1><48>: Abbrev Number: 2 (DW_TAG_base_type)
    <49>   DW_AT_byte_size   : 2
    <4a>   DW_AT_encoding    : 7	(unsigned)
    <4b>   DW_AT_name        : (indirect string, offset: 0x6c): short unsigned int
 <1><4f>: Abbrev Number: 4 (DW_TAG_typedef)
    <50>   DW_AT_name        : S16
    <54>   DW_AT_decl_file   : 1
    <55>   DW_AT_decl_line   : 28
    <56>   DW_AT_type        : <0x5a>
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 5	(signed)
    <5d>   DW_AT_name        : (indirect string, offset: 0x18c): short int
 <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 1
    <63>   DW_AT_encoding    : 8	(unsigned char)
    <64>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char
 <1><68>: Abbrev Number: 4 (DW_TAG_typedef)
    <69>   DW_AT_name        : S08
    <6d>   DW_AT_decl_file   : 1
    <6e>   DW_AT_decl_line   : 30
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 2 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 1
    <75>   DW_AT_encoding    : 8	(unsigned char)
    <76>   DW_AT_name        : (indirect string, offset: 0x5c): char
 <1><7a>: Abbrev Number: 2 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 8
    <7c>   DW_AT_encoding    : 7	(unsigned)
    <7d>   DW_AT_name        : (indirect string, offset: 0x3c): long long unsigned int
 <1><81>: Abbrev Number: 2 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 8
    <83>   DW_AT_encoding    : 5	(signed)
    <84>   DW_AT_name        : (indirect string, offset: 0x15d): long long int
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 4
    <8a>   DW_AT_encoding    : 7	(unsigned)
    <8b>   DW_AT_name        : (indirect string, offset: 0x154): sizetype
 <1><8f>: Abbrev Number: 5 (DW_TAG_structure_type)
    <90>   DW_AT_byte_size   : 9
    <91>   DW_AT_decl_file   : 2
    <92>   DW_AT_decl_line   : 7
    <93>   DW_AT_linkage_name: (indirect string, offset: 0x183): 7in_type
    <97>   DW_AT_sibling     : <0xcc>
 <2><9b>: Abbrev Number: 6 (DW_TAG_member)
    <9c>   DW_AT_name        : (indirect string, offset: 0x61): Statusword
    <a0>   DW_AT_decl_file   : 2
    <a1>   DW_AT_decl_line   : 7
    <a2>   DW_AT_type        : <0x3d>
    <a6>   DW_AT_data_member_location: 0
 <2><a7>: Abbrev Number: 6 (DW_TAG_member)
    <a8>   DW_AT_name        : (indirect string, offset: 0x1e): Inputs
    <ac>   DW_AT_decl_file   : 2
    <ad>   DW_AT_decl_line   : 7
    <ae>   DW_AT_type        : <0x27>
    <b2>   DW_AT_data_member_location: 2
 <2><b3>: Abbrev Number: 6 (DW_TAG_member)
    <b4>   DW_AT_name        : (indirect string, offset: 0x16b): ModesOfOperationDisplay
    <b8>   DW_AT_decl_file   : 2
    <b9>   DW_AT_decl_line   : 7
    <ba>   DW_AT_type        : <0x68>
    <be>   DW_AT_data_member_location: 6
 <2><bf>: Abbrev Number: 6 (DW_TAG_member)
    <c0>   DW_AT_name        : (indirect string, offset: 0xc): AnalogInput
    <c4>   DW_AT_decl_file   : 2
    <c5>   DW_AT_decl_line   : 7
    <c6>   DW_AT_type        : <0x4f>
    <ca>   DW_AT_data_member_location: 7
 <2><cb>: Abbrev Number: 0
 <1><cc>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd>   DW_AT_name        : (indirect string, offset: 0x184): in_type
    <d1>   DW_AT_decl_file   : 2
    <d2>   DW_AT_decl_line   : 12
    <d3>   DW_AT_type        : <0x8f>
 <1><d7>: Abbrev Number: 5 (DW_TAG_structure_type)
    <d8>   DW_AT_byte_size   : 9
    <d9>   DW_AT_decl_file   : 2
    <da>   DW_AT_decl_line   : 15
    <db>   DW_AT_linkage_name: (indirect string, offset: 0x32): 8out_type
    <df>   DW_AT_sibling     : <0x108>
 <2><e3>: Abbrev Number: 6 (DW_TAG_member)
    <e4>   DW_AT_name        : (indirect string, offset: 0x196): ModesOfOperation
    <e8>   DW_AT_decl_file   : 2
    <e9>   DW_AT_decl_line   : 15
    <ea>   DW_AT_type        : <0x68>
    <ee>   DW_AT_data_member_location: 0
 <2><ef>: Abbrev Number: 6 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0x54e): TargetPosition
    <f4>   DW_AT_decl_file   : 2
    <f5>   DW_AT_decl_line   : 15
    <f6>   DW_AT_type        : <0x32>
    <fa>   DW_AT_data_member_location: 1
 <2><fb>: Abbrev Number: 6 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x144): ProfileVelocity
    <100>   DW_AT_decl_file   : 2
    <101>   DW_AT_decl_line   : 15
    <102>   DW_AT_type        : <0x27>
    <106>   DW_AT_data_member_location: 5
 <2><107>: Abbrev Number: 0
 <1><108>: Abbrev Number: 7 (DW_TAG_typedef)
    <109>   DW_AT_name        : (indirect string, offset: 0x33): out_type
    <10d>   DW_AT_decl_file   : 2
    <10e>   DW_AT_decl_line   : 19
    <10f>   DW_AT_type        : <0xd7>
 <1><113>: Abbrev Number: 5 (DW_TAG_structure_type)
    <114>   DW_AT_byte_size   : 6
    <115>   DW_AT_decl_file   : 2
    <116>   DW_AT_decl_line   : 22
    <117>   DW_AT_linkage_name: (indirect string, offset: 0x25): 10inOut_type
    <11b>   DW_AT_sibling     : <0x138>
 <2><11f>: Abbrev Number: 6 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x0): Controlword
    <124>   DW_AT_decl_file   : 2
    <125>   DW_AT_decl_line   : 22
    <126>   DW_AT_type        : <0x3d>
    <12a>   DW_AT_data_member_location: 0
 <2><12b>: Abbrev Number: 6 (DW_TAG_member)
    <12c>   DW_AT_name        : (indirect string, offset: 0x7f): Outputs
    <130>   DW_AT_decl_file   : 2
    <131>   DW_AT_decl_line   : 22
    <132>   DW_AT_type        : <0x27>
    <136>   DW_AT_data_member_location: 2
 <2><137>: Abbrev Number: 0
 <1><138>: Abbrev Number: 7 (DW_TAG_typedef)
    <139>   DW_AT_name        : (indirect string, offset: 0x27): inOut_type
    <13d>   DW_AT_decl_file   : 2
    <13e>   DW_AT_decl_line   : 25
    <13f>   DW_AT_type        : <0x113>
 <1><143>: Abbrev Number: 8 (DW_TAG_variable)
    <144>   DW_AT_name        : In
    <147>   DW_AT_decl_file   : 3
    <148>   DW_AT_decl_line   : 12
    <149>   DW_AT_type        : <0xcc>
    <14d>   DW_AT_external    : 1
    <14d>   DW_AT_location    : 5 byte block: 3 0 e 0 20 	(DW_OP_addr: 20000e00)
 <1><153>: Abbrev Number: 8 (DW_TAG_variable)
    <154>   DW_AT_name        : Out
    <158>   DW_AT_decl_file   : 3
    <159>   DW_AT_decl_line   : 13
    <15a>   DW_AT_type        : <0x108>
    <15e>   DW_AT_external    : 1
    <15e>   DW_AT_location    : 5 byte block: 3 40 e 0 20 	(DW_OP_addr: 20000e40)
 <1><164>: Abbrev Number: 9 (DW_TAG_variable)
    <165>   DW_AT_name        : (indirect string, offset: 0x18): InOut
    <169>   DW_AT_decl_file   : 3
    <16a>   DW_AT_decl_line   : 14
    <16b>   DW_AT_type        : <0x138>
    <16f>   DW_AT_external    : 1
    <16f>   DW_AT_location    : 5 byte block: 3 80 e 0 20 	(DW_OP_addr: 20000e80)
 <1><175>: Abbrev Number: 0
  Compilation Unit @ offset 0x176:
   Length:        0x537 (32-bit)
   Version:       4
   Abbrev Offset: 0x7e
   Pointer Size:  4
 <0><181>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <182>   DW_AT_producer    : (indirect string, offset: 0x87): GNU C++ 4.8.4 -mcpu=cortex-m3 -mthumb -g -O0 -fno-exceptions -fmessage-length=0 -fno-common -fgcse-after-reload -fno-builtin -fsingle-precision-constant -fdata-sections -ffunction-sections
    <186>   DW_AT_language    : 4	(C++)
    <187>   DW_AT_name        : (indirect string, offset: 0x30c): C:\Plug & Drive Studio\PNDS-2.1.7-x86\workspace\NanoJ project\gen\mappings\ReferenceSetup.cpp
    <18b>   DW_AT_ranges      : 0x0
    <18f>   DW_AT_low_pc      : 0x0
    <193>   DW_AT_stmt_list   : 0x86
 <1><197>: Abbrev Number: 2 (DW_TAG_base_type)
    <198>   DW_AT_byte_size   : 4
    <199>   DW_AT_encoding    : 7	(unsigned)
    <19a>   DW_AT_name        : (indirect string, offset: 0x46): unsigned int
 <1><19e>: Abbrev Number: 3 (DW_TAG_base_type)
    <19f>   DW_AT_byte_size   : 4
    <1a0>   DW_AT_encoding    : 5	(signed)
    <1a1>   DW_AT_name        : int
 <1><1a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <1a6>   DW_AT_name        : U32
    <1aa>   DW_AT_decl_file   : 3
    <1ab>   DW_AT_decl_line   : 25
    <1ac>   DW_AT_type        : <0x197>
 <1><1b0>: Abbrev Number: 4 (DW_TAG_typedef)
    <1b1>   DW_AT_name        : S32
    <1b5>   DW_AT_decl_file   : 3
    <1b6>   DW_AT_decl_line   : 26
    <1b7>   DW_AT_type        : <0x19e>
 <1><1bb>: Abbrev Number: 4 (DW_TAG_typedef)
    <1bc>   DW_AT_name        : U16
    <1c0>   DW_AT_decl_file   : 3
    <1c1>   DW_AT_decl_line   : 27
    <1c2>   DW_AT_type        : <0x1c6>
 <1><1c6>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c7>   DW_AT_byte_size   : 2
    <1c8>   DW_AT_encoding    : 7	(unsigned)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x6c): short unsigned int
 <1><1cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <1ce>   DW_AT_name        : S16
    <1d2>   DW_AT_decl_file   : 3
    <1d3>   DW_AT_decl_line   : 28
    <1d4>   DW_AT_type        : <0x1d8>
 <1><1d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d9>   DW_AT_byte_size   : 2
    <1da>   DW_AT_encoding    : 5	(signed)
    <1db>   DW_AT_name        : (indirect string, offset: 0x18c): short int
 <1><1df>: Abbrev Number: 4 (DW_TAG_typedef)
    <1e0>   DW_AT_name        : U08
    <1e4>   DW_AT_decl_file   : 3
    <1e5>   DW_AT_decl_line   : 29
    <1e6>   DW_AT_type        : <0x1ea>
 <1><1ea>: Abbrev Number: 2 (DW_TAG_base_type)
    <1eb>   DW_AT_byte_size   : 1
    <1ec>   DW_AT_encoding    : 8	(unsigned char)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char
 <1><1f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <1f2>   DW_AT_name        : S08
    <1f6>   DW_AT_decl_file   : 3
    <1f7>   DW_AT_decl_line   : 30
    <1f8>   DW_AT_type        : <0x1fc>
 <1><1fc>: Abbrev Number: 2 (DW_TAG_base_type)
    <1fd>   DW_AT_byte_size   : 1
    <1fe>   DW_AT_encoding    : 8	(unsigned char)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x5c): char
 <1><203>: Abbrev Number: 2 (DW_TAG_base_type)
    <204>   DW_AT_byte_size   : 8
    <205>   DW_AT_encoding    : 7	(unsigned)
    <206>   DW_AT_name        : (indirect string, offset: 0x3c): long long unsigned int
 <1><20a>: Abbrev Number: 2 (DW_TAG_base_type)
    <20b>   DW_AT_byte_size   : 8
    <20c>   DW_AT_encoding    : 5	(signed)
    <20d>   DW_AT_name        : (indirect string, offset: 0x15d): long long int
 <1><211>: Abbrev Number: 2 (DW_TAG_base_type)
    <212>   DW_AT_byte_size   : 4
    <213>   DW_AT_encoding    : 7	(unsigned)
    <214>   DW_AT_name        : (indirect string, offset: 0x154): sizetype
 <1><218>: Abbrev Number: 5 (DW_TAG_structure_type)
    <219>   DW_AT_byte_size   : 9
    <21a>   DW_AT_decl_file   : 4
    <21b>   DW_AT_decl_line   : 7
    <21c>   DW_AT_linkage_name: (indirect string, offset: 0x183): 7in_type
    <220>   DW_AT_sibling     : <0x255>
 <2><224>: Abbrev Number: 6 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x61): Statusword
    <229>   DW_AT_decl_file   : 4
    <22a>   DW_AT_decl_line   : 7
    <22b>   DW_AT_type        : <0x1bb>
    <22f>   DW_AT_data_member_location: 0
 <2><230>: Abbrev Number: 6 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x1e): Inputs
    <235>   DW_AT_decl_file   : 4
    <236>   DW_AT_decl_line   : 7
    <237>   DW_AT_type        : <0x1a5>
    <23b>   DW_AT_data_member_location: 2
 <2><23c>: Abbrev Number: 6 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x16b): ModesOfOperationDisplay
    <241>   DW_AT_decl_file   : 4
    <242>   DW_AT_decl_line   : 7
    <243>   DW_AT_type        : <0x1f1>
    <247>   DW_AT_data_member_location: 6
 <2><248>: Abbrev Number: 6 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0xc): AnalogInput
    <24d>   DW_AT_decl_file   : 4
    <24e>   DW_AT_decl_line   : 7
    <24f>   DW_AT_type        : <0x1cd>
    <253>   DW_AT_data_member_location: 7
 <2><254>: Abbrev Number: 0
 <1><255>: Abbrev Number: 7 (DW_TAG_typedef)
    <256>   DW_AT_name        : (indirect string, offset: 0x184): in_type
    <25a>   DW_AT_decl_file   : 4
    <25b>   DW_AT_decl_line   : 12
    <25c>   DW_AT_type        : <0x218>
 <1><260>: Abbrev Number: 5 (DW_TAG_structure_type)
    <261>   DW_AT_byte_size   : 9
    <262>   DW_AT_decl_file   : 4
    <263>   DW_AT_decl_line   : 15
    <264>   DW_AT_linkage_name: (indirect string, offset: 0x32): 8out_type
    <268>   DW_AT_sibling     : <0x291>
 <2><26c>: Abbrev Number: 6 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0x196): ModesOfOperation
    <271>   DW_AT_decl_file   : 4
    <272>   DW_AT_decl_line   : 15
    <273>   DW_AT_type        : <0x1f1>
    <277>   DW_AT_data_member_location: 0
 <2><278>: Abbrev Number: 6 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x54e): TargetPosition
    <27d>   DW_AT_decl_file   : 4
    <27e>   DW_AT_decl_line   : 15
    <27f>   DW_AT_type        : <0x1b0>
    <283>   DW_AT_data_member_location: 1
 <2><284>: Abbrev Number: 6 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x144): ProfileVelocity
    <289>   DW_AT_decl_file   : 4
    <28a>   DW_AT_decl_line   : 15
    <28b>   DW_AT_type        : <0x1a5>
    <28f>   DW_AT_data_member_location: 5
 <2><290>: Abbrev Number: 0
 <1><291>: Abbrev Number: 7 (DW_TAG_typedef)
    <292>   DW_AT_name        : (indirect string, offset: 0x33): out_type
    <296>   DW_AT_decl_file   : 4
    <297>   DW_AT_decl_line   : 19
    <298>   DW_AT_type        : <0x260>
 <1><29c>: Abbrev Number: 5 (DW_TAG_structure_type)
    <29d>   DW_AT_byte_size   : 6
    <29e>   DW_AT_decl_file   : 4
    <29f>   DW_AT_decl_line   : 22
    <2a0>   DW_AT_linkage_name: (indirect string, offset: 0x25): 10inOut_type
    <2a4>   DW_AT_sibling     : <0x2c1>
 <2><2a8>: Abbrev Number: 6 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x0): Controlword
    <2ad>   DW_AT_decl_file   : 4
    <2ae>   DW_AT_decl_line   : 22
    <2af>   DW_AT_type        : <0x1bb>
    <2b3>   DW_AT_data_member_location: 0
 <2><2b4>: Abbrev Number: 6 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x7f): Outputs
    <2b9>   DW_AT_decl_file   : 4
    <2ba>   DW_AT_decl_line   : 22
    <2bb>   DW_AT_type        : <0x1a5>
    <2bf>   DW_AT_data_member_location: 2
 <2><2c0>: Abbrev Number: 0
 <1><2c1>: Abbrev Number: 7 (DW_TAG_typedef)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x27): inOut_type
    <2c6>   DW_AT_decl_file   : 4
    <2c7>   DW_AT_decl_line   : 25
    <2c8>   DW_AT_type        : <0x29c>
 <1><2cc>: Abbrev Number: 8 (DW_TAG_subprogram)
    <2cd>   DW_AT_external    : 1
    <2cd>   DW_AT_name        : (indirect string, offset: 0x258): Reset
    <2d1>   DW_AT_decl_file   : 1
    <2d2>   DW_AT_decl_line   : 21
    <2d3>   DW_AT_linkage_name: (indirect string, offset: 0x47b): _Z5Resetv
    <2d7>   DW_AT_low_pc      : 0x0
    <2db>   DW_AT_high_pc     : 0x26
    <2df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2e1>   DW_AT_GNU_all_tail_call_sites: 1
 <1><2e1>: Abbrev Number: 8 (DW_TAG_subprogram)
    <2e2>   DW_AT_external    : 1
    <2e2>   DW_AT_name        : (indirect string, offset: 0x3ed): Quickstop
    <2e6>   DW_AT_decl_file   : 1
    <2e7>   DW_AT_decl_line   : 27
    <2e8>   DW_AT_linkage_name: (indirect string, offset: 0x533): _Z9Quickstopv
    <2ec>   DW_AT_low_pc      : 0x8008410
    <2f0>   DW_AT_high_pc     : 0x40
    <2f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2f6>   DW_AT_GNU_all_tail_call_sites: 1
 <1><2f6>: Abbrev Number: 8 (DW_TAG_subprogram)
    <2f7>   DW_AT_external    : 1
    <2f7>   DW_AT_name        : (indirect string, offset: 0x541): Shutdown
    <2fb>   DW_AT_decl_file   : 1
    <2fc>   DW_AT_decl_line   : 37
    <2fd>   DW_AT_linkage_name: (indirect string, offset: 0x5d8): _Z8Shutdownv
    <301>   DW_AT_low_pc      : 0x8008450
    <305>   DW_AT_high_pc     : 0x4a
    <309>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <30b>   DW_AT_GNU_all_tail_call_sites: 1
 <1><30b>: Abbrev Number: 8 (DW_TAG_subprogram)
    <30c>   DW_AT_external    : 1
    <30c>   DW_AT_name        : (indirect string, offset: 0x3bc): SwitchOn
    <310>   DW_AT_decl_file   : 1
    <311>   DW_AT_decl_line   : 47
    <312>   DW_AT_linkage_name: (indirect string, offset: 0x51d): _Z8SwitchOnv
    <316>   DW_AT_low_pc      : 0x0
    <31a>   DW_AT_high_pc     : 0x8a
    <31e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <320>   DW_AT_GNU_all_tail_call_sites: 1
 <1><320>: Abbrev Number: 8 (DW_TAG_subprogram)
    <321>   DW_AT_external    : 1
    <321>   DW_AT_name        : (indirect string, offset: 0x21d): EnableOperation
    <325>   DW_AT_decl_file   : 1
    <326>   DW_AT_decl_line   : 62
    <327>   DW_AT_linkage_name: (indirect string, offset: 0x2ca): _Z15EnableOperationv
    <32b>   DW_AT_low_pc      : 0x800849c
    <32f>   DW_AT_high_pc     : 0xca
    <333>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <335>   DW_AT_GNU_all_tail_call_sites: 1
 <1><335>: Abbrev Number: 8 (DW_TAG_subprogram)
    <336>   DW_AT_external    : 1
    <336>   DW_AT_name        : (indirect string, offset: 0x5b1): RelativeMovement
    <33a>   DW_AT_decl_file   : 1
    <33b>   DW_AT_decl_line   : 82
    <33c>   DW_AT_linkage_name: (indirect string, offset: 0x4c5): _Z16RelativeMovementv
    <340>   DW_AT_low_pc      : 0x0
    <344>   DW_AT_high_pc     : 0x26
    <348>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <34a>   DW_AT_GNU_all_tail_call_sites: 1
 <1><34a>: Abbrev Number: 8 (DW_TAG_subprogram)
    <34b>   DW_AT_external    : 1
    <34b>   DW_AT_name        : (indirect string, offset: 0x247): AbsoluteMovement
    <34f>   DW_AT_decl_file   : 1
    <350>   DW_AT_decl_line   : 88
    <351>   DW_AT_linkage_name: (indirect string, offset: 0x5c2): _Z16AbsoluteMovementv
    <355>   DW_AT_low_pc      : 0x8008568
    <359>   DW_AT_high_pc     : 0x26
    <35d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <35f>   DW_AT_GNU_all_tail_call_sites: 1
 <1><35f>: Abbrev Number: 9 (DW_TAG_subprogram)
    <360>   DW_AT_external    : 1
    <360>   DW_AT_name        : (indirect string, offset: 0x285): NewSetPoint
